---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricSheet..::..Create Method
FabricSheet Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, Element, ElementId) | Creates a new instance of a single flat Fabric Sheet element within the project. |
|  | Create(Document, ElementId, ElementId, CurveLoop) | Creates a new instance of a single bent Fabric Sheet element within the project. |

# See Also

FabricSheet Class

FabricSheet Members

Autodesk.Revit.DB.Structure Namespace